In [ ]:
# import necessary libraries

In [1]:
import pandas as pd
import random

In [ ]:
# Let's read all web scrapped files


df_match_info = pd.read_csv(folder_path + 'match_summary.csv')
df_batting = pd.read_csv(folder_path + 'batting_summary.csv')
df_bowling = pd.read_csv(folder_path + 'bowling_summary.csv')
df_players = pd.read_csv(folder_path + 'players_data.csv')

In [6]:
df_match_info.shape 
df_match_info.head(2)

,team1,team2,winner,margin,matchDate,scorecard_link
0,Super Kings,Titans,Titans,5 wickets,"Mar 31, 2023",https://www.espncricinfo.com/series/indian-pre...
1,Punjab Kings,KKR,Punjab Kings,7 runs,"Apr 1, 2023",https://www.espncricinfo.com/series/indian-pre...

In [7]:
df_batting.shape 
df_batting.head(2)

,match,teamInnings,battingPos,batsmanName,dismissal,runs,balls,4s,6s,SR,matchDate
0,Super Kings Vs Titans,Super Kings,1,DevonConway,b Mohammed Shami,1,6,0,0,16.66,"Mar 31, 2023"
1,Super Kings Vs Titans,Super Kings,2,RuturajGaikwad,c Shubman Gill b Joseph,92,50,4,9,184.00,"Mar 31, 2023"

In [8]:
df_bowling.shape 
df_bowling.head(2)

,match,bowlingTeam,bowlerName,overs,maiden,runs,wickets,economy,0s,4s,6s,wides,noBalls,matchDate
0,Super Kings Vs Titans,Titans,MohammedShami,4.0,0,29,2,7.25,13,2,2,0,1,"Mar 31, 2023"
1,Super Kings Vs Titans,Titans,HardikPandya,3.0,0,28,0,9.33,6,2,2,0,0,"Mar 31, 2023"

In [9]:
df_players.shape 
df_players.head(2)

,name,team,battingStyle,bowlingStyle,playingRole
0,DevonConway,Super Kings,Left hand Bat,Right arm Medium,Wicketkeeper Batter
1,RuturajGaikwad,Super Kings,Right hand Bat,Right arm Offbreak,Batter

In [10]:
# 1: Assiging Unique 'match_ids'

In [11]:
#combination of team1, team2, match_date. 

#step1: Create a column which in format like 'team1 Vs team2 Vs match_date'

df_match_info['combined_cols'] = df_match_info['team1'] + ' Vs ' + df_match_info['team2'] + ' Vs ' + df_match_info['matchDate']
df_match_info.head(2)

,team1,team2,winner,margin,matchDate,scorecard_link,combined_cols
0,Super Kings,Titans,Titans,5 wickets,"Mar 31, 2023",https://www.espncricinfo.com/series/indian-pre...,"Super Kings Vs Titans Vs Mar 31, 2023"
1,Punjab Kings,KKR,Punjab Kings,7 runs,"Apr 1, 2023",https://www.espncricinfo.com/series/indian-pre...,"Punjab Kings Vs KKR Vs Apr 1, 2023"

In [12]:
#for batting and bowling too
df_batting['combined_cols'] = df_batting['match'] + ' Vs ' + df_batting['matchDate']
df_bowling['combined_cols'] = df_bowling['match'] + ' Vs ' + df_bowling['matchDate']

In [13]:
df_batting.head(2)

,match,teamInnings,battingPos,batsmanName,dismissal,runs,balls,4s,6s,SR,matchDate,combined_cols
0,Super Kings Vs Titans,Super Kings,1,DevonConway,b Mohammed Shami,1,6,0,0,16.66,"Mar 31, 2023","Super Kings Vs Titans Vs Mar 31, 2023"
1,Super Kings Vs Titans,Super Kings,2,RuturajGaikwad,c Shubman Gill b Joseph,92,50,4,9,184.00,"Mar 31, 2023","Super Kings Vs Titans Vs Mar 31, 2023"

In [14]:
df_bowling.head(2)

,match,bowlingTeam,bowlerName,overs,maiden,runs,wickets,economy,0s,4s,6s,wides,noBalls,matchDate,combined_cols
0,Super Kings Vs Titans,Titans,MohammedShami,4.0,0,29,2,7.25,13,2,2,0,1,"Mar 31, 2023","Super Kings Vs Titans Vs Mar 31, 2023"
1,Super Kings Vs Titans,Titans,HardikPandya,3.0,0,28,0,9.33,6,2,2,0,0,"Mar 31, 2023","Super Kings Vs Titans Vs Mar 31, 2023"

In [15]:
# Unique Match_IDS

In [16]:
#create a list of all unique values
all_matches = df_match_info['combined_cols'].unique().tolist()
print(all_matches[: 5])
print(len(all_matches))

['Super Kings Vs Titans Vs Mar 31, 2023', 'Punjab Kings Vs KKR Vs Apr 1, 2023', 'Super Giants Vs Capitals Vs Apr 1, 2023', 'Royals Vs Sunrisers Vs Apr 2, 2023', 'Mumbai Vs RCB Vs Apr 2, 2023']
73

In [17]:
#let assign a unique id for each match_id 
unique_ids = set()

while len(unique_ids) < len(all_matches ):
    unique_id = "T20" + str(random.randint(1000, 9999))
    unique_ids.add(unique_id)

unique_ids_list = list(unique_ids)
print(unique_ids_list[: 5])

['T201024', 'T201984', 'T202118', 'T205799', 'T209119']

In [18]:
#let's create a dictionary for this. 
#key: value <---> match: match_id

dict_matches = {}
for match_combined, match_id in zip(all_matches, unique_ids):
    dict_matches[match_combined] = match_id
    
print(dict_matches)

{'Super Kings Vs Titans Vs Mar 31, 2023': 'T201024', 'Punjab Kings Vs KKR Vs Apr 1, 2023': 'T201984', 'Super Giants Vs Capitals Vs Apr 1, 2023': 'T202118', 'Royals Vs Sunrisers Vs Apr 2, 2023': 'T205799', 'Mumbai Vs RCB Vs Apr 2, 2023': 'T209119', 'Super Kings Vs Super Giants Vs Apr 3, 2023': 'T204565', 'Capitals Vs Titans Vs Apr 4, 2023': 'T205800', 'Punjab Kings Vs Royals Vs Apr 5, 2023': 'T203821', 'KKR Vs RCB Vs Apr 6, 2023': 'T204700', 'Sunrisers Vs Super Giants Vs Apr 7, 2023': 'T207167', 'Royals Vs Capitals Vs Apr 8, 2023': 'T208381', 'Mumbai Vs Super Kings Vs Apr 8, 2023': 'T203311', 'Titans Vs KKR Vs Apr 9, 2023': 'T202276', 'Punjab Kings Vs Sunrisers Vs Apr 9, 2023': 'T201496', 'RCB Vs Super Giants Vs Apr 10, 2023': 'T207660', 'Capitals Vs Mumbai Vs Apr 11, 2023': 'T202917', 'Royals Vs Super Kings Vs Apr 12, 2023': 'T207293', 'Punjab Kings Vs Titans Vs Apr 13, 2023': 'T201922', 'Sunrisers Vs KKR Vs Apr 14, 2023': 'T205592', 'RCB Vs Capitals Vs Apr 15, 2023': 'T208419', 'Super Giants Vs Punjab Kings Vs Apr 15, 2023': 'T206187', 'KKR Vs Mumbai Vs Apr 16, 2023': 'T208293', 'Titans Vs Royals Vs Apr 16, 2023': 'T209473', 'Super Kings Vs RCB Vs Apr 17, 2023': 'T205892', 'Mumbai Vs Sunrisers Vs Apr 18, 2023': 'T205890', 'Super Giants Vs Royals Vs Apr 19, 2023': 'T209264', 'RCB Vs Punjab Kings Vs Apr 20, 2023': 'T202988', 'KKR Vs Capitals Vs Apr 20, 2023': 'T205790', 'Sunrisers Vs Super Kings Vs Apr 21, 2023': 'T208456', 'Titans Vs Super Giants Vs Apr 22, 2023': 'T208285', 'Punjab Kings Vs Mumbai Vs Apr 22, 2023': 'T205238', 'RCB Vs Royals Vs Apr 23, 2023': 'T205453', 'Super Kings Vs KKR Vs Apr 23, 2023': 'T202281', 'Capitals Vs Sunrisers Vs Apr 24, 2023': 'T209217', 'Titans Vs Mumbai Vs Apr 25, 2023': 'T204984', 'KKR Vs RCB Vs Apr 26, 2023': 'T202067', 'Royals Vs Super Kings Vs Apr 27, 2023': 'T202362', 'Super Giants Vs Punjab Kings Vs Apr 28, 2023': 'T206702', 'KKR Vs Titans Vs Apr 29, 2023': 'T205217', 'Sunrisers Vs Capitals Vs Apr 29, 2023': 'T208313', 'Super Kings Vs Punjab Kings Vs Apr 30, 2023': 'T206978', 'Royals Vs Mumbai Vs Apr 30, 2023': 'T209643', 'RCB Vs Super Giants Vs May 1, 2023': 'T208852', 'Capitals Vs Titans Vs May 2, 2023': 'T207946', 'Punjab Kings Vs Mumbai Vs May 3, 2023': 'T205158', 'KKR Vs Sunrisers Vs May 4, 2023': 'T206056', 'Royals Vs Titans Vs May 5, 2023': 'T207978', 'Mumbai Vs Super Kings Vs May 6, 2023': 'T208071', 'RCB Vs Capitals Vs May 6, 2023': 'T202585', 'Titans Vs Super Giants Vs May 7, 2023': 'T204240', 'Royals Vs Sunrisers Vs May 7, 2023': 'T204692', 'Punjab Kings Vs KKR Vs May 8, 2023': 'T206414', 'RCB Vs Mumbai Vs May 9, 2023': 'T208195', 'Super Kings Vs Capitals Vs May 10, 2023': 'T209449', 'KKR Vs Royals Vs May 11, 2023': 'T203371', 'Mumbai Vs Titans Vs May 12, 2023': 'T202899', 'Sunrisers Vs Super Giants Vs May 13, 2023': 'T206538', 'Punjab Kings Vs Capitals Vs May 13, 2023': 'T201197', 'RCB Vs Royals Vs May 14, 2023': 'T204878', 'Super Kings Vs KKR Vs May 14, 2023': 'T205357', 'Titans Vs Sunrisers Vs May 15, 2023': 'T207487', 'Super Giants Vs Mumbai Vs May 16, 2023': 'T209585', 'Capitals Vs Punjab Kings Vs May 17, 2023': 'T208869', 'Sunrisers Vs RCB Vs May 18, 2023': 'T205282', 'Punjab Kings Vs Royals Vs May 19, 2023': 'T202647', 'Super Kings Vs Capitals Vs May 20, 2023': 'T207547', 'Super Giants Vs KKR Vs May 20, 2023': 'T207562', 'Sunrisers Vs Mumbai Vs May 21, 2023': 'T208173', 'RCB Vs Titans Vs May 21, 2023': 'T206950', 'Super Kings Vs Titans Vs May 23, 2023': 'T209488', 'Mumbai Vs Super Giants Vs May 24, 2023': 'T203503', 'Titans Vs Mumbai Vs May 26, 2023': 'T208961', 'Titans Vs Super Kings Vs May 29, 2023': 'T209434'}

In [19]:
#let's map them for all the tables

df_match_info['match_id'] = df_match_info['combined_cols'].map(dict_matches)
df_batting['match_id'] = df_batting['combined_cols'].map(dict_matches)
df_bowling['match_id'] = df_bowling['combined_cols'].map(dict_matches)

In [20]:
#remove the created column and  not required cols

df_match_info.drop("combined_cols", axis = 1, inplace = True)
df_batting.drop("combined_cols", axis = 1, inplace = True)
df_bowling.drop("combined_cols", axis = 1, inplace = True)


#match date in batting and bowling
df_batting.drop("matchDate", axis = 1, inplace = True)
df_bowling.drop("matchDate", axis = 1, inplace = True)

In [23]:
df_match_info.head(2)

,team1,team2,winner,margin,matchDate,scorecard_link,match_id
0,Super Kings,Titans,Titans,5 wickets,"Mar 31, 2023",https://www.espncricinfo.com/series/indian-pre...,T201024
1,Punjab Kings,KKR,Punjab Kings,7 runs,"Apr 1, 2023",https://www.espncricinfo.com/series/indian-pre...,T201984

In [22]:
df_batting.head(2)

,match,teamInnings,battingPos,batsmanName,dismissal,runs,balls,4s,6s,SR,match_id
0,Super Kings Vs Titans,Super Kings,1,DevonConway,b Mohammed Shami,1,6,0,0,16.66,T201024
1,Super Kings Vs Titans,Super Kings,2,RuturajGaikwad,c Shubman Gill b Joseph,92,50,4,9,184.00,T201024

In [24]:
df_bowling.head(2)

,match,bowlingTeam,bowlerName,overs,maiden,runs,wickets,economy,0s,4s,6s,wides,noBalls,match_id
0,Super Kings Vs Titans,Titans,MohammedShami,4.0,0,29,2,7.25,13,2,2,0,1,T201024
1,Super Kings Vs Titans,Titans,HardikPandya,3.0,0,28,0,9.33,6,2,2,0,0,T201024

In [25]:
# 2: Cleaning Names of players¶
# 1. Removing Unusal Character

In [26]:
df_players.iloc[0]['name']

'DevonConway\xa0'

In [27]:
df_batting.iloc[0]['batsmanName']

'DevonConway\xa0'

In [28]:
#players 
df_players['name'] = df_players['name'].apply(lambda x: x.replace('â€', ''))
df_players['name'] = df_players['name'].apply(lambda x: x.replace('\xa0', ''))


#batting
df_batting['batsmanName'] = df_batting['batsmanName'].apply(lambda x: x.replace('â€', ''))
df_batting['batsmanName']= df_batting['batsmanName'].apply(lambda x: x.replace('\xa0', ''))


#bowling
df_bowling['bowlerName'] = df_bowling['bowlerName'].apply(lambda x: x.replace('â€', ''))
df_bowling['bowlerName'] = df_bowling['bowlerName'].apply(lambda x: x.replace('\xa0', ''))

In [29]:
# 2: Removing (c) and † symbol

In [30]:
df_players[(df_players['name'] == 'ViratKohli') | (df_players['name'] == 'ViratKohli(c)')]

              name team    battingStyle      bowlingStyle       playingRole
123     ViratKohli  RCB  Right hand Bat  Right arm Medium  Top order Batter
238  ViratKohli(c)  RCB  Right hand Bat  Right arm Medium  Top order Batter

In [31]:
df_players[(df_players['name'] == 'DineshKarthik†') | (df_players['name'] == 'DineshKarthik')]

,name,team,battingStyle,bowlingStyle,playingRole
125,DineshKarthik†,RCB,Right hand Bat,Right arm Offbreak,Wicketkeeper Batter
319,DineshKarthik,RCB,Right hand Bat,Right arm Offbreak,Wicketkeeper Batter

In [32]:
df_players['name'] = df_players['name'].apply(lambda x: x.replace('(c)', ''))
df_players['name'] = df_players['name'].apply(lambda x: x.replace('†', ''))


#batting
df_batting['batsmanName'] = df_batting['batsmanName'].apply(lambda x: x.replace('(c)', ''))
df_batting['batsmanName']= df_batting['batsmanName'].apply(lambda x: x.replace('†', ''))


#bowling
df_bowling['bowlerName'] = df_bowling['bowlerName'].apply(lambda x: x.replace('(c)', ''))
df_bowling['bowlerName'] = df_bowling['bowlerName'].apply(lambda x: x.replace('†', ''))

In [33]:
#drop duplciates in df_players

df_players = df_players.drop_duplicates(subset='name').reset_index(drop=True)

In [34]:
# 3: out/not_out column

In [35]:
df_batting['out/not_out'] = df_batting.dismissal.apply(lambda x: "out" if x != "not out" else "not_out")

In [36]:
df_batting.drop(columns=["dismissal"], inplace=True)

In [37]:
df_batting.head(2)

,match,teamInnings,battingPos,batsmanName,runs,balls,4s,6s,SR,match_id,out/not_out
0,Super Kings Vs Titans,Super Kings,1,DevonConway,1,6,0,0,16.66,T201024,out
1,Super Kings Vs Titans,Super Kings,2,RuturajGaikwad,92,50,4,9,184.00,T201024,out

In [38]:
# ### 4: Final Data and storing

In [39]:
df_match_info.drop(columns=["scorecard_link"], inplace=True)

In [40]:
df_match_info.head(2)

          team1   team2        winner     margin     matchDate match_id
0   Super Kings  Titans        Titans  5 wickets  Mar 31, 2023  T201024
1  Punjab Kings     KKR  Punjab Kings     7 runs   Apr 1, 2023  T201984

In [49]:
df_match_info.to_csv('D:/College/9TH SEM/webscrapped/dim_match_summary.csv', index = False)

In [42]:
df_batting = df_batting[['match_id', 'match', 'teamInnings', 'battingPos', 'batsmanName', 'out/not_out',
                         'runs', 'balls','4s', '6s', 'SR']]

In [43]:
df_batting.head(2)

,match_id,match,teamInnings,battingPos,batsmanName,out/not_out,runs,balls,4s,6s,SR
0,T201024,Super Kings Vs Titans,Super Kings,1,DevonConway,out,1,6,0,0,16.66
1,T201024,Super Kings Vs Titans,Super Kings,2,RuturajGaikwad,out,92,50,4,9,184.00

In [48]:
df_batting.to_csv('D:/College/9TH SEM/webscrapped/fact_bating_summary.csv', index = False)

In [45]:
df_bowling = df_bowling[['match_id', 'match', 'bowlingTeam', 'bowlerName', 'overs', 'maiden', 'runs',
       'wickets', 'economy', '0s', '4s', '6s', 'wides', 'noBalls']]

In [50]:
df_bowling.head(2)

,match_id,match,bowlingTeam,bowlerName,overs,maiden,runs,wickets,economy,0s,4s,6s,wides,noBalls
0,T201024,Super Kings Vs Titans,Titans,MohammedShami,4.0,0,29,2,7.25,13,2,2,0,1
1,T201024,Super Kings Vs Titans,Titans,HardikPandya,3.0,0,28,0,9.33,6,2,2,0,0

In [51]:
df_bowling.to_csv('D:/College/9TH SEM/webscrapped/fact_bowling_summary.csv', index = False)

In [52]:
df_players.head(2)

,name,team,battingStyle,bowlingStyle,playingRole
0,DevonConway,Super Kings,Left hand Bat,Right arm Medium,Wicketkeeper Batter
1,RuturajGaikwad,Super Kings,Right hand Bat,Right arm Offbreak,Batter

In [53]:
df_players.to_csv('D:/College/9TH SEM/webscrapped/dim_players.csv', index = False)